/***************************************************************************************************
*FileName:
*Description:
*Author:
*Data:
***************************************************************************************************/

/***************************************************************************************************/
/******************************************头文件***************************************************/
/***************************************************************************************************/
#include	"UpLoad_Fun.h"
#include	"ServerFun.h"
#include	"SDFunction.h"
#include	"Net_Data.h"

#include	"MyMem.h"
#include	"CRC16.h"

#include	"FreeRTOS.h"
#include 	"task.h"
#include 	"queue.h"
#include	"semphr.h"

#include	"stdio.h"
#include	"string.h"
/***************************************************************************************************/
/**************************************局部变量声明*************************************************/
/***************************************************************************************************/

/***************************************************************************************************/
/**************************************局部函数声明*************************************************/
/***************************************************************************************************/
static void UpLoadDeviceInfo(void);
/***************************************************************************************************/
/***************************************************************************************************/
/***************************************正文********************************************************/
/***************************************************************************************************/
/***************************************************************************************************/
/***************************************************************************************************/

void UpLoadFunction(void)
{
	static unsigned int count = 0;
	while(1)
	{
		if((Link_Up == GetGB_NCDServerLinkState())&&((count % 10) == 0))
			UpLoadDeviceInfo();
		
		count++;
		vTaskDelay(1000 / portTICK_RATE_MS);
	}
}


static void UpLoadDeviceInfo(void)
{
	DeviceInfo * deviceinfo = NULL;
	char * buf = NULL;
	
	deviceinfo = MyMalloc(sizeof(DeviceInfo));
	buf = MyMalloc(2048);
	
	MyGetFreeHeapSize();
	if(deviceinfo && buf)
	{
		if((My_Pass == ReadDeviceInfo(deviceinfo)) && (deviceinfo->crc == CalModbusCRC16Fun1(deviceinfo, sizeof(DeviceInfo)-2)) &&
			(deviceinfo->isfresh == 1))
		{
			memset(buf, 0, 2048);
			
			sprintf(buf, "id1=%s&name=荧光免疫分析仪&manufacture=武汉纽康度生物科技股份有限公司&tel=1234567890&status=在线&address=%s&needmainten=否",
				deviceinfo->deviceid, deviceinfo->deviceunit);

			if(My_Pass == UpLoadData("http://123.57.94.39/api/myFluorescenceInfo/", buf, strlen(buf)))
			{
				deviceinfo->isfresh = 0;
				SaveDeviceInfo(deviceinfo);
			}
		}
	}
	
	MyFree(deviceinfo);
	MyFree(buf);
}
