#ifndef _DEFINE_H_H
#define _DEFINE_H_H

#include	"stm32f4xx.h"
#include 	"FreeRTOS.h"
#include	"ff.h"

#define		NormalCode	0											//Õı³£³ÌĞò
#define		LabCode	1											//²âÊÔ³ÌĞò
	
#define		CodeType	LabCode									//³ÌĞò·ÖÀà

#define		AdminPassWord	"123456"								//¹ÜÀíÔ±ÃÜÂë£¬ÓÃÓÚĞŞ¸ÄÉè±¸id
#define		AdjustPassWord	"111111"								//Ğ£×¼ÃÜÂë
#define		TestPassWord	"222222"								//ÀÏ»¯²âÊÔÃÜÂë

#define		MY_SUCCESS	1
#define		MY_FALSE	0

/***************************************************************************************************/
/***************************************************************************************************/
/*****************************************Èí¼ş°æ±¾**************************************************/
/***************************************************************************************************/
/***************************************************************************************************/
/*V1.0.03*/
#define	GB_SoftVersion_1	1
#define	GB_SoftVersion_2	0
#define	GB_SoftVersion_3	3
/**********************************************************************************************************/
/******************************************²Ù×÷½á¹û±äÁ¿*************************************************/
/**********************************************************************************************************/
typedef enum
{ 
	My_Pass = pdPASS,		//²Ù×÷³É¹¦
	My_Fail = pdFAIL			//²Ù×÷Ê§°Ü
}MyState_TypeDef;

typedef enum
{ 
	true = 1,
	false = 0
}bool;

typedef enum
{ 
	LED_Error = 1,		//led´íÎó
	LED_OK = 0			//ledÕı³£
}MyLEDCheck_TypeDef;
/**********************************************************************************************************/
/**********************************************************************************************************/
typedef enum
{ 
	NormalTestType = 0,																	//³£¹æ²âÊÔ
	PaiDuiTestType = 1																	//ÅÅ¶Ó²âÊÔ
}TestType;
/**********************************************************************************************************/
/******************************************fatfs½á¹¹Ìå¶¨Òå*************************************************/
/**********************************************************************************************************/
/*´Ë½á¹¹ÌåÓÃÓÚÔÚ½øĞĞsd²Ù×÷ÊÇÉêÇëÄÚ´æ*/
typedef struct
{
	FIL file;
	UINT br;
	UINT bw;
	FRESULT res;
	FSIZE_t size;
}FatfsFileInfo_Def; 

typedef struct
{
	DIR dir;
	FRESULT res;
	FSIZE_t size;
}FatfsDirInfo_Def; 


/**********************************************************************************************************/
/**********************************************************************************************************/

#define	PaiDuiWeiNum	8							//ÅÅ¶ÓÎ»ÖÃÊıÄ¿
typedef enum
{
	statuesNull = 0,								//Ã»¿ªÊ¼,¿¨ÔÚ¿¨²Û
	statues1 = 1,									//µÈ´ı´Ó¿¨²Û°Î³ö
	statues2 = 2,									//µÈ´ı²åÈëÅÅ¶ÓÎ»
	statues3 = 3,									//µÈ´ı°Î³öÅÅ¶ÓÎ»
	statues4 = 4,									//µÈ´ı²åÈë¿¨²Û
	statues5 = 5,									//µ¹¼ÆÊ±ÖĞ
	statues6 = 6,									//³¬Ê±¼ÆÊ±ÖĞ
	statues7 = 7,									//ÅÅ¶Ó½áÊø
	startpaidui = 100								//Æô¶¯ÅÅ¶Ó
}MyPaiDuiStatues;


/**********************************************************************************************************/
/******************************************Ê±¼ä½á¹¹Ìå¶¨Òå**************************************************/
/**********************************************************************************************************/
#pragma pack(1)
typedef struct
{
	unsigned char year;
	unsigned char month;
	unsigned char day;
	unsigned char hour;
	unsigned char min;
	unsigned char sec;
}MyTime_Def;
#pragma pack()
/**********************************************************************************************************/
/**********************************************************************************************************/



/**********************************************************************************************************/
/******************************************ÎÂ¶È½á¹¹Ìå¶¨Òå**************************************************/
/**********************************************************************************************************/
#pragma pack(1)
typedef struct
{
	float  E_Temperature;			//»·¾³ÎÂ¶È
	float	O_Temperature;			//±»²âÎïÌåÎÂ¶È
	float I_Temperature;			//ÄÚ²¿ÎÂ¶È
}MyTemp_Def;
#pragma pack()
/**********************************************************************************************************/
/**********************************************************************************************************/

/**********************************************************************************************************/
/******************************************¶şÎ¬ÂëÏà¹Ø¶¨Òå**************************************************/
/**********************************************************************************************************/

#define	ScanOutTime						10			//????s
#define	CodeMaxLen						300			//???????
#define	ItemNameLen						20			//????????
#define	ItemMeasureLen					10			//????????
#define	CardPiCiHaoLen					30			//????????


/*???????*/
typedef enum
{
	CardCodeScanning = 0,											//ÕıÔÚÉ¨Ãè
	CardCodeScanOK = 1,												//É¨Ãè¶şÎ¬Âë³É¹¦
	CardCodeScanFail = 2,											//É¨ÃèÊ§°Ü
	CardCodeTimeOut = 3,											//¹ıÆÚ
	CardCodeCardOut = 4,											//¿¨±»°Î³ö
	CardCodeScanTimeOut = 5,										//É¨Ãè³¬Ê±
	CardCodeCRCError = 6											//crc´íÎó
}ScanCodeResult;

#pragma pack(1)
typedef struct CardInfo_Tag
{
	char	ItemName[ItemNameLen];						//²âÊÔÏîÄ¿
	unsigned char	TestType;							//·å¸ß¼ÆËã·½Ê½
	float	NormalResult;								//Õı³£Öµ
	float	LowstResult;								//×îµÍ¼ì²âÏß
	float	HighestResult;								//×î¸ß¼ì²âÏß
	char	ItemMeasure[ItemMeasureLen];				//²âÊÔµ¥Î»
	unsigned short ItemLocation;						//TÏßÎ»ÖÃ
	unsigned char ItemBiaoQuNum;						//±ê×¼ÇúÏßÊıÄ¿
	float	ItemFenDuan;								//·Ö¶Î·å¸ß±È
	float	ItemBiaoQu[2][3];							//±ê×¼ÇúÏß
			//2 --- ?2???
			//3 --- a , b, c  (????)
	unsigned char CardWaitTime;							//¼ì²â¿¨·´Ó¦Ê±¼ä
	unsigned short CLineLocation;						//cÏßÎ»ÖÃ
	char	CardPiCi[CardPiCiHaoLen];					//Åú´ÎºÅ
	MyTime_Def	CardBaoZhiQi;						//±£ÖÊÆÚ
	unsigned short CRC16;								//crc
}CardCodeInfo;
#pragma pack()


#pragma pack(1)
typedef struct ScanQRTaskData_Tag
{
	CardCodeInfo * cardQR;
	ScanCodeResult scanresult;
}ScanQRTaskData;
#pragma pack()

#define	MaxLocation			6500						//×î´óĞĞ³Ì
#define	StartTestLocation	1250							//²âÊÔÆğÊ¼Î»ÖÃ
#define	EndTestLocation		4300						//²âÊÔ½áÊøÎªÖ¹
#define	WaittingCardLocation	MaxLocation					//µÈ´ı²å¿¨µÄÎ»ÖÃ
#define	AvregeNum		10								//Æ½¾ùÖµÂË²¨¸öÊı
#define	FilterNum		5								//Æ½»¬ÂË²¨¸öÊı
#define	MaxPointLen		((EndTestLocation - StartTestLocation)/AvregeNum - FilterNum)	//²âÊÔµã¸öÊı


/**********************************************************************************************************/
/**********************************************************************************************************/

/**********************************************************************************************************/
/******************************************ÑùÆ·IDÏà¹Ø¶¨Òå**************************************************/
/**********************************************************************************************************/
#define	MaxSampleIDLen	20											//×îóÖ§³ÖÑùÆ·id³¤¶ÈÎª20
/**********************************************************************************************************/
/**********************************************************************************************************/

/**********************************************************************************************************/
/******************************************½çÃæÏà¹Ø¶¨Òå****************************************************/
/***************************************************************************´*******************************/

typedef struct LineInfo_Tag
{
	unsigned short MaxData;				//ÊµÊ±ÇúÏß×î´óµÄÊıÖµ
	unsigned short Y_Scale;				//ÇúÏßyÖá×îµÍµÄ¿Ì¶È
	unsigned short MUL_Y;				//YÖá·Å´ó±¶Êı
}LineInfo;

/**********************************************************************************************************/
/**********************************************************************************************************/

/**********************************************************************************************************/
/******************************************ÆÁÄ»Ïà¹Ø¶¨Òå****************************************************/
/**********************************************************************************************************/
#define	LCD_Head_1		0xAA											//Ğ­ÒéÍ·1
#define	LCD_Head_2		0xBB											//Ğ­ÒéÍ·2

#define W_REGSITER 		0x80          									//Ğ´ÈëÊı¾İ,ÎŞÓ¦´ğ          
#define R_REGSITER 	0x81          									//¶ÁÈ¡Êı¾İ£¬ÓĞÓ¦´ğ
#define W_ADDRESS  		0x82											//Ğ´±äÁ¿¼Ä´æÆ÷£¬ÎŞÓ¦´ğ
#define R_ADDRESS  	0x83											//¶Á±äÁ¿¼Ä´æÆ÷Êı¾İ£¬ÓĞÓ¦´ğ
#define W_LINE     		0x84          									//Ğ´ÇúÏß»º³åÇø£¬ÎŞÓ¦´ğ

#pragma pack(1)
typedef struct BasicICO_Tag
{
	unsigned short X;
	unsigned short Y;
	unsigned short ICO_ID;
}Basic_ICO;
#pragma pack()
/**********************************************************************************************************/
/**********************************************************************************************************/

/**********************************************************************************************************/
/******************************************²Ù×÷ÈËÏà¹Ø¶¨Òå****************************************************/
/**********************************************************************************************************/
#define	MaxUserNum	20													//×î¶à±£´æµÄÓÃ»§ÊıÄ¿
#define	MaxPageShowNum	5												//Ò»Ò³ÏÔÊ¾ÓÃ»§ÊıÄ¿

#define	MaxNameLen	11
#define	MaxSexLen	5
#define	MaxAgeLen	7
#define	MaxPhoneLen	17
#define	MaxJobLen	33
#define	MaxDescLen	65

#pragma pack(1)
typedef struct UserTag
{ 
	char user_name[MaxNameLen];
	char user_sex[MaxSexLen];
	char user_age[MaxAgeLen];
	char user_phone[MaxPhoneLen];
	char user_job[MaxJobLen];
	char user_desc[MaxDescLen];
	unsigned short crc;
}User_Type;
#pragma pack() 
/**********************************************************************************************************/
/**********************************************************************************************************/

/**********************************************************************************************************/
/******************************************Éè±¸ĞÅÏ¢Ïà¹Ø¶¨Òå****************************************************/
/**********************************************************************************************************/
#define	MaxDeviceIDLen	21
#define	MaxDeviceUnitLen	51

#pragma pack(1)
typedef struct DeviceInfo_Tag
{
	char deviceid[MaxDeviceIDLen];													//Éè±¸id
	char deviceunit[MaxDeviceUnitLen];												//Éè±¸Ê¹ÓÃµ¥Î»
	User_Type deviceuser;															//Éè±¸Ê¹ÓÃÈË
	unsigned char isnew;															//Éè±¸ĞÅÏ¢ÊÇ·ñÓĞ¸üĞÂ
	unsigned short crc;
}DeviceInfo;
#pragma pack()
/**********************************************************************************************************/
/**********************************************************************************************************/

/**********************************************************************************************************/
/******************************************×Ô¼ì¹¦ÄÜÏà¹Ø¶¨Òå****************************************************/
/**********************************************************************************************************/

typedef enum
{ 
	ReadServerData = 0,												//¼ÓÔØ·şÎñÆ÷Êı¾İ
	ReadServerError = 1,												//·şÎñÆ÷Êı¾İÊ§°Ü
	ReadServerSuccess = 2,												//·şÎñÆ÷Êı¾İ³É¹¦
	
	ErWeiMaChecking = 3,												//ÕıÔÚ¼ì²é¶şÎ¬Âë
	ErWeiMaError = 4,													//¶şÎ¬Âë´íÎó
	ErWeiMaSuccess = 5,													//¶şÎ¬ÂëÕı³£
	
	DataBasesChecking = 6,												//ÕıÔÚ¼ì²é´æ´¢Ä£¿é
	DataBasesError = 7,													//´æ´¢Ä£¿é´íÎó
	DataBasesSuccess = 8,												//´æ´¢Ä£¿éÕı³£
	
	WIFIChecking = 9,													//ÕıÔÚ¼ì²éWIFI
	WIFIError = 10,														//WIFI´íÎó
	WIFISuccess = 11,													//WIFIÕı³£
	
	ADDAChecking = 12,													//ÕıÔÚ¼ì²é²É¼¯Ä£¿é
	ADDAError = 13,														//²É¼¯Ä£¿é´íÎó
	ADDASuccess = 14,													//²É¼¯Ä£¿éÕı³£
	
	MotorChecking = 15,													//ÕıÔÚ¼ì²é²É¼¯Ä£¿é
	MotorError = 16,														//²É¼¯Ä£¿é´íÎó
	MotorSuccess = 17,													//²É¼¯Ä£¿éÕı³£
	
	
	
	SelfCheckOver = 18													//×Ô¼ìÍê³É
}SelfCheck_TypeDef;

typedef enum
{
	SelfCheck_None = 0,													//×Ô¼ìÎ´¿ªÊ¼
	SelfChecking = 1,
	SelfCheck_OK = 2,													//×Ô¼ìÕı³£
	SelfCheck_Error = 3,												//×Ô¼ìÓĞ²»¿ÉºöÂÔµÄ´íÎó
}SelfCheckStatus;
/**********************************************************************************************************/
/**********************************************************************************************************/


/**********************************************************************************************************/
/******************************************ÍøÂçÏà¹Ø¶¨Òå****************************************************/
/**********************************************************************************************************/
#pragma pack(1)
typedef struct ip_Tag
{
	unsigned char ip_1;
	unsigned char ip_2;
	unsigned char ip_3;
	unsigned char ip_4;
}IP_Def;
#pragma pack()

#define	MaxWifiListNum	20												//×î¶àÏÔÊ¾20¸öÈÈµã
#define	PageWifiNum		10
#define	MaxSSIDLen		50
#define	MaxKEYLen		20

/*wifiÈÈµã*/
#pragma pack(1)
typedef struct wifi_Tag
{
	char ssid[MaxSSIDLen];														//SSID
	char auth[20];														//ÈÏÖ¤Ä£Ê½
	char encry[10];														//¼ÓÃÜ·½Ê½
	unsigned char indicator;											//ĞÅºÅÇ¿¶È
	char key[MaxKEYLen];														//ÃÜÂë
	unsigned short crc;
}WIFI_Def;
#pragma pack()


typedef struct mynetbuf_tag
{
	void * data;
	unsigned short datalen;
}mynetbuf;

typedef enum
{ 
	Link_Down = 0,
	Link_Up = 1
}LinkState_TypeDef;

/*ip»ñÈ¡·½Ê½*/
typedef enum
{
	DHCP_Mode = 1,														//×Ô¶¯»ñÈ¡¶¯Ì¬ip
	User_Mode = 2														//ÓÃ»§ÉèÖÃip
}NetIP_Type;


#pragma pack(1)
typedef struct NetData_Tag
{
	IP_Def myip;														//ÎÒµÄip

	NetIP_Type ipmode;
	unsigned short crc;
}NetData;
#pragma pack()


/**********************************************************************************************************/
/**********************************************************************************************************/

#define	MaxTestDataSaveNum	(unsigned int)1000000
	

/*********************************************************************************************/
/*********************************************************************************************/
/*********************************************************************************************/
/**************************Ğ£×¼²ÎÊı***********************************************************/
/*********************************************************************************************/

#pragma pack(1)
typedef struct AdjustData_tag
{
	char ItemName[ItemNameLen];
	float parm;
	unsigned short crc;
}AdjustData;
#pragma pack()

typedef enum
{
	NoResult = 0,										//»¹Î´²âÊÔ£¬½á¹ûÎ´null
	NoSample = 1,										//Î´¼ÓÑù
	PeakError = 2,										//¼ì²â¿¨Ã»ÓĞC·å
	MemError = 3,										//ÄÚ´æ´íÎó
	TestInterrupt = 8,									//²âÊÔÖĞ¶Ï
	ResultIsOK = 99,									//²âÊÔ³É¹¦
}ResultState;

#pragma pack(1)
typedef struct TestLine_tag {
	unsigned short TestPoint[MaxPointLen];
	unsigned short C_Point[2];
	unsigned short T_Point[2];
	unsigned short B_Point[2];
	float BasicBili;
	float BasicResult;
	float AdjustResult;
} TestLine;
#pragma pack()

#pragma pack(1)
typedef struct TestData_tag {
	User_Type user;
	char sampleid[MaxSampleIDLen];
	CardCodeInfo temperweima;
	AdjustData tempadjust;
	TestLine testline;
	MyTime_Def TestTime;					//²âÊÔÊ±¼ä
	MyTemp_Def TestTemp;					//²âÊÔÎÂ¶È
	unsigned short time;					//³¬Ê±Ê±¼ä
	unsigned short crc;
}TestData;
#pragma pack()

/*********************************************************************************************/
/*********************************************************************************************/
/*********************************************************************************************/
/*******************************¶¨Ê±Æ÷********************************************************/
/*********************************************************************************************/
#pragma pack(1)
typedef struct
{
	unsigned int start;
	unsigned int interval;
}Timer;
#pragma pack()

typedef enum
{ 
	TimeNotTo = 0,		//¼ÆÊ±Ê±¼äÎ´µ½
	TimeOut = 1,		//¼ÆÊ±Ê±¼äµ½
	TimeError = 2,		//´íÎó
}TimerState_Def;


/*********************************************************************************************/
/*********************************************************************************************/
/*********************************************************************************************/
/*******************************ÀÏ»¯²âÊÔÊı¾İ**************************************************/
/*********************************************************************************************/
#pragma pack(1)
typedef struct ReTestData_tag{
	unsigned int retestcount;								//×Ü´ÎÊı
	unsigned short retestsurpluscount;						//Ê£Óà²âÊÔ´ÎÊı
	unsigned short retestedcount;							//ÒÑ¾­²âÊÔ´ÎÊı
	unsigned char reteststatus;								//ÀÏ»¯²âÊÔ×´Ì¬£¬0Í£Ö¹£¬1µÈ´ı²å¿¨£¬2¶Á¶şÎ¬Âë£¬3²âÊÔ
	Timer retesttimer;										//ÀÏ»¯²âÊÔ¼ÆÊ±Æ÷
	Timer oneretesttimer;									//Ò»´ÎÀÏ»¯²âÊÔ¼ÆÊ±Æ÷
	TestData testdata;										//ÀÏ»¯²âÊÔÊı¾İ¿Õ¼ä
	char result[30];										//µ±Ç°²âÊÔµÄ½áÂÛ
	unsigned short playcount;								//ÀÏ»¯²¥·Å¼ÆÊıÆ÷£¬¼ÇÂ¼²¥·Å´ÎÊı
	Timer playtimer;										//ÀÏ»¯ÒôÆµ×ÜÊ±¼ä	
	Timer oneplaytimer;										//ÀÏ»¯²¥·Å¼ÆÊ±Æ÷£¬¼ÇÂ¼Ã¿´Î²¥·ÅµÄÊ±³¤
	MyTime_Def startplayTime;								//µ±Ç°ÒôÆµÆğÊ¼Ê±¼ä
	MyTime_Def endplayTime;									//µ±Ç°ÒôÆµ½áÊøÊ±¼ä
	double advalue1;										//DAÖµ100Ê±µÄADÖµ
	double advalue2;										//DAÖµ200Ê±µÄADÖµ
	double advalue3;										//DAÖµ300Ê±µÄADÖµ
	MyLEDCheck_TypeDef ledstatus;							//·¢¹âÄ£¿é×´Ì¬
}ReTestData;
#pragma pack()

#endif

